[
  {
    "url": "https://www.washingtonpost.com/sports/2024/02/14/chiefs-parade-super-bowl-kansas-city/",
    "headline": "Shooting at Kansas City Chiefs parade leaves 1 dead, 21 injured, officials say",
    "publishDate": "2024-02-14T13:03:33.721Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/22UNWOIN7BGFFH4GRJXINULUFE_size-normalized.jpg&w=1440",
    "description": "A shooting near the Kansas City Chiefs Super Bowl parade killed 1 person and injured at least 21. Three are in custody, police said.",
    "content": "The Chiefs won the Super Bowl, 25-22, over the 49ers as time expired in overtime. Get the details by signing up for our newsletter.\n\nThe win: Patrick Mahomes led the Chiefs to their fourth Super Bowl in his six seasons as a starter. While tight end Travis Kelce has commanded much of the spotlight dating Taylor Swift, it was a three-yard touchdown pass to Mecole Hardman in overtime that delivered the Chiefs their third championship in five seasons.\n\nUsher’s halftime show: Usher worked hard at the halftime show to cram more than a dozen songs into just as many minutes. If you were keeping a tally, the message was clear: Usher has hits. Also: Usher has friends.\n\nSuper Bowl commercials: Here are the best, worst and strangest commercials that played during Sunday night’s big game.\n\nTaylor Swift: Taylor Swift made it to the Super Bowl to support Travis Kelce and the Chiefs from the VIP suite. From conspiracy theories to her jet, Swift seemingly couldn’t avoid the spotlight.\n\nBeyoncé: Beyoncé's ad got the BeyHive buzzing as she released two new songs and announced a new album."
  },
  {
    "url": "https://www.washingtonpost.com/nation/2024/02/16/kansas-city-shooting-charges/?itid=lk_inline_manual_9",
    "headline": "Two juveniles charged after Kansas City Super Bowl parade shooting",
    "publishDate": "2024-02-16T20:14:35.182Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M2YTWVESJGAEDBD2ZOZFJAFIXI_size-normalized.jpg&w=1440",
    "description": "One woman was killed and more than 20 others wounded as gunfire exploded after a rally held to honor the Chiefs’ Sunday victory over the San Francisco 49ers",
    "content": "LAWRENCE, Kan. — Two juveniles held after gunfire exploded at the end of a crowded rally for the Kansas City Chiefs’ Super Bowl victory — killing one and injuring nearly two dozen others — have been criminally charged, authorities said Friday. They were charged Thursday with gun-related offenses and resisting arrest, Jackson County family court officials said in a statement. The two were being held in a juvenile detention facility.\n\nWhat police described as a dispute among several people outside the city’s Union Station on Wednesday sent fans scattering and fleeing over barricades as police and first responders — some 800 were on hand — descended upon the chaotic scene. Three people were taken into custody — including one who was tackled by Chiefs fans — a short time later. An adult detainee was later released.\n\nSgt. Jacob P. Becchina, a spokesman for the Kansas City Police Department, said in an email Friday that the teens had been held as authorities worked with juvenile prosecutors to determine the charges. The juvenile court system will determine their custody status, Becchina said.\n\nThe statement said that while the juveniles had been detained on “gun-related and resisting arrest” charges, “additional charges are expected in the future as the investigation by the Kansas City Police Department continues.”\n\nPolice have not revealed details about guns used in the shooting, besides saying several weapons were recovered. Mayor Quinton Lucas told The Washington Post in an interview Thursday that the “biggest challenge” for police in his Missouri city is the modification of firearms as well as “the ongoing presence of semiautomatic weapons.”\n\nOn Friday, musician Taylor Swift — who is dating Chiefs tight end Travis Kelce — donated $100,000 to the family of Elizabeth “Lisa” Lopez-Galvan, the Johnson County woman who was killed Wednesday afternoon.\n\nLopez-Galvan, 43, a mother of two adult children, was a popular local DJ who hosted a program called “A Taste of Tejano” on the Kansas City radio station KKFI. The trade publication Variety first reported the donation, and the Associated Press verified the posts.\n\n“Sending my deepest sympathies and condolences in the wake of your devastating loss. With love, Taylor Swift,” the singer wrote on the Lopez-Galvan’s memorial GoFundMe page.\n\nThe shooting devastated the Kansas City community, and came at the end of what was a storybook season for the Chiefs, after the team overcame initial struggles to take its second consecutive Super Bowl title in an overtime victory against the San Francisco 49ers.\n\nOn Friday, quarterback Patrick Mahomes and his wife, Brittany, visited some of the injured children at a hospital, according to photos posted on social media.\n\nMahomes announced on X, formerly known as Twitter, that the Chiefs had established an emergency response fund for “victims and their families, violence prevention and mental health services, and first responders.”"
  },
  {
    "url": "https://www.washingtonpost.com/nation/2024/02/15/kansas-city-shooting-bystanders-tackle-suspect/?itid=lk_inline_manual_36",
    "headline": "Chiefs fans tackled suspect after parade shooting",
    "publishDate": "2024-02-15T20:55:22.676Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6AMUOFFNMDX6CQUNQXVYUZ4WKA_size-normalized.jpg&w=1440",
    "description": "Fast-acting Chiefs fans are being credited with springing into action as the Super Bowl rally and parade turned to chaos with a shooting that killed one woman.",
    "content": "As Trey Filter’s family left the rally celebrating the Kansas City Chiefs’ Super Bowl win Wednesday, his son asked him if the loud bangs they were hearing were gunshots. Filter said no, figuring they were celebratory firecrackers. Moments later, Filter heard someone in the crowd yell, “Get him!” He saw a flash to his left, a man running by. Filter jumped on him, hoping it was the right person.\n\nHe and other bystanders tackled one of the three people detained by police for the shooting, and Filter’s wife, Casey, picked up a gun that landed near the suspect and moved it away, the couple recounted Thursday on “Good Morning America.” They, fellow fast-acting Chiefs fan Paul Contreras and other bystanders are being credited with springing into action as the celebration turned to chaos.\n\nThe gunfire broke out as the Kansas City Chiefs’ Super Bowl victory parade was wrapping up. One person, a radio DJ and mother of two, was killed and 22 were wounded by gunshots.\n\nThe shooting appeared to have resulted from a dispute among several people and was not an instance of terrorism or extremism, authorities said Thursday. Three people were detained by police, two of whom are minors, and are under investigation in the incident. No arrests have been made so far.\n\nWitness video verified by Storyful showed a small crowd fleeing as the suspected gunman ran down a grassy sideline area while bystanders pursued and then tackled him. The bystanders appeared to bring down one of the suspected gunmen, wrestling him to the ground and pinning him down until police arrived moments later.\n\n“They helped one another and even physically stopped a person who was believed to be involved in the incident,” Graves said. “I want to thank the people who acted bravely yesterday alongside law enforcement. … Your selfless act did not go unnoticed.”\n\nThe Filters, Contreras and Contreras’s daughter, Alyssa Marsh-Contreras, have given multiple interviews on local and national television recounting their stories since the incident Wednesday. They were not immediately available for comment Thursday.\n\nContreras and his three daughters were walking back to their car when they heard the gunshots, which they also thought were fireworks until they heard shouts, he recounted. Contreras jumped on the man, like others nearby. It all happened in seconds.\n\nAs he tackled the man, Contreras told local television station KETV, “I see his weapon either fell out of his hand or his sleeve.”\n\nStanding next to them, Casey Filter saw the gun on the ground. At first, she thought it was a toy.\n\n“But then, once I picked it up, I realized it definitely was not,” she told GMA. She described it as “an AK” to Fox News.\n\nThose crowded around the man waited for police to arrive, still in shock. Marsh-Contreras said she thought the suspect was in his late teens.\n\n“They just kept him down” until the police came, she said, describing the situation as “very scary.”\n\n“You can’t be scared,” he said. “Not saying that you want it to happen, but there’s always that chance. It could happen at work, anywhere, the grocery store.”"
  },
  {
    "url": "https://www.washingtonpost.com/nation/2024/02/15/kansas-chiefs-parade-shooting-suspect-shooter/?itid=lk_inline_manual_38",
    "headline": "What we know about the shooting at the Kansas City Chiefs parade",
    "publishDate": "2024-02-15T07:42:22.670Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FKWVDE4FWOQDUEVY2QFEKT7XIA.jpg&w=1440",
    "description": "One person was killed and at least 21 injured in Kansas City, Mo., during celebrations for the Chiefs’ Super Bowl win.",
    "content": "One person was killed and at least 22 were injured at a rally after a parade Wednesday celebrating the Kansas City Chiefs’ win at the Super Bowl. Shots were fired near Union Station in Kansas City, Mo., where Chiefs players had addressed the fan rally. Video showed people running from the site and police entering the building.\n\nThe shooting stemmed from a dispute among “several” people and spilled into the crowd, police said in a news conference Thursday. Two of those in custody are minors. Police said the shooting had no connection to terrorism.\n\nLisa Lopez-Galvan, a radio DJ and host of “A Taste of Tejano” on Kansas City radio station KKFI, was killed in the shooting, Tommy Andrade, a family friend and co-host of the show, told The Washington Post. Andrade said Lopez-Galvan’s husband, Mike, informed him of her death. In a statement, the station called her death a “senseless act.”\n\nAndrade described Lopez-Galvan, a mother of two, as a kind person with an infectious smile. “She treated everyone she knew and loved as close family. She will be missed,” he said.\n\nEight of those injured had immediately life-threatening injuries, and seven others had life-threatening injuries, Kansas City interim fire chief Ross Grundyson told reporters. Six others were considered to have minor injuries, he said.\n\nPolice have taken three people into custody and recovered firearms but have not yet disclosed a motive. Kansas City Police Chief Stacey Graves said the shooting happened despite a heavy police presence because of “bad actors.” Hundreds of law enforcement officers were policing the parade, she said, which allowed for a quick response.\n\nLaw enforcement has asked anyone who might have video of the shooting or of alleged shooters fleeing the scene to submit it to an FBI portal as authorities work to investigate the motive.\n\nThe shooting is the latest high-profile example of the entrenched problem of gun violence in the United States. President Biden said Wednesday that the shooting in Kansas City should “shock us” into acting to limit gun violence.\n\n“This is difficult for our community,” Lucas said in a statement posted to social media. “We will continue to work hard to ensure assailants are brought to justice, our victims receive exceptional care, all families impacted receive our support and that we as a city and country do all we can to prevent tragedies like this from ever occurring again.”\n\nTravis Kelce, the celebrated Chiefs tight end, also said he was “heartbroken” over the parade shooting. “My heart is with all who came out to celebrate with us and have been affected. KC, you mean the world to me,” he said in a post on social media."
  },
  {
    "url": "https://www.washingtonpost.com/nation/2024/02/15/kansas-city-shooting-super-bowl-rally/?itid=lk_inline_manual_10",
    "headline": "Kansas City shooting stemmed from personal dispute, officials say",
    "publishDate": "2024-02-15T16:35:50.344Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UNAUSYDJPNOFQL4RVAAPIYD6DA_size-normalized.jpg&w=1440",
    "description": "The shooting, which police say stemmed from a personal dispute, left one woman dead and 22 people injured as the celebration for the Super Bowl champion Chiefs ended.",
    "content": "The deadly shooting that turned a celebration for the Kansas City Chiefs into a tragedy on Wednesday appeared to stem from a dispute among several people and had “no nexus to terrorism or homegrown violent extremism,” officials said Thursday morning. Kansas City Police Chief Stacey Graves said at a briefing that two of three people detained are juveniles. None has been charged yet, and additional detentions or arrests are possible, she said.\n\nThe shooting occurred about 2 p.m. amid a crowd of fans outside the city’s Union Station as the parade and rally for the Super Bowl champions drew to a close. At the sound of gunfire, people fled in every direction while police and first responders began swarming the scene. The three people were taken into custody a short time later.\n\nOne woman was killed and 22 people were injured in a matter of minutes. The victims’ ages range from 8 to 47, Graves said, and at least half are younger than 16.\n\n“This incident is still a very active investigation,” she noted. Authorities must charge the people in custody within 24 hours or release them, she said, adding that “we have all intentions of presenting charges.”\n\nA statement from the University Health hospital in Kansas City said three gunshot victims remained there Thursday, including two in critical condition. Saint Luke’s Hospital of Kansas City was continuing to treat one victim, who was still listed as in critical condition Thursday. Children’s Mercy had received a dozen victims, nine with gunshot wounds, in the aftermath of the rally. All are expected to recover, according to a hospital spokesperson.\n\nThe city continued to clean up the scene, which was still littered Thursday morning after with fans’ folding chairs, Chiefs regalia, and red and yellow confetti. The Jackson County prosecutor’s office was offering counseling services for members of the public feeling traumatized by what they had witnessed.\n\n“We are seeing more things with a lot of people getting hit, even unintentionally. I’m not going to get ahead of the facts here, but it is something that I think is a very real concern,” he said.\n\n“I’d be lying to you if I didn’t say that we’ll probably evaluate in the event that we’re blessed to have another Super Bowl championship,” Lucas said in an interview Thursday morning, wondering whether future gatherings would need to be held at a stadium or other location where attendees would be wanded at security checkpoints.\n\nThe shooting was the latest to upend a community’s celebration with deadly violence. And with parades coming up on St. Patrick’s Day next month, “my city and many American cities will be tested,” Lucas said. “Is this just something we live with in the same way that we’re living with school shootings and the threat to movie theaters and the threat to bowling alleys?”\n\nLucas said he had spoken Thursday morning with Illinois Gov. J. B. Pritzker (D) about a 2022 shooting — allegedly by a 21-year-old man armed with an semiautomatic rifle — that left seven people dead and several dozen wounded at a Fourth of July parade in Highland Park, Ill. Lucas said he told Pritzker that “I shouldn’t be surprised that something like this could happen at a parade or rally, but you always are.”\n\nOne security expert, Michael Chertoff, former secretary of the federal Department of Homeland Security, also raised the issue of ensuring safety with such open events. In a stadium, he noted, “you can screen people for bringing in weapons or things that are dangerous, potential bombs. And you also can funnel them in through a portal that gives you control over everybody who comes in. Obviously, when you’re dealing with the street, you don’t have that capability.”\n\nOfficials declined Thursday to comment on the kinds of weapons used in the parade shooting. Missouri, which has some of the nation’s laxest gun laws, has no age minimum for possession of a firearm, though federal law prohibits minors from possessing handguns except in rare circumstances. A bill that Missouri legislators passed three years ago declared federal gun laws invalid and prohibited state and local authorities from enforcing them, but that law is tied up in court.\n\nThe Kansas City Council last August passed two ordinances to strengthen gun laws in the city. One measure banned specific weapons, including machine guns, firearm silencers and components, such as bump stocks, that turn semiautomatic guns into fully automatic weapons. The other prohibited the transfer of weapons, including ammunition, to minors. The mayor said at the time that he believed the ordinances complied with state law."
  },
  {
    "url": "https://www.washingtonpost.com/nation/2024/02/15/kansas-city-parade-shooting-victims-lisa-lopez-galvan/?itid=lk_inline_manual_46",
    "headline": "Beloved DJ Lisa Lopez-Galvan killed in Kansas City parade shooting",
    "publishDate": "2024-02-15T15:35:04.826Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/R72N64NPVFHCVIZMIJWHQVDRZU.JPG&w=1440",
    "description": "A shooting near the Kansas City Chiefs’ Super Bowl parade killed one person and injured 22. Lisa Lopez-Galvan’s radio station, KKFI, announced her death.",
    "content": "It was just like any other Tuesday night. Elizabeth “Lisa” Lopez-Galvan was on air for her weekly radio show, “A Taste of Tejano,” sharing her love of music. The program features Tejano music, a “Tex-Mex” fusion of Mexican and American musical influences.“Let us know if you have a birthday, anniversary or special announcement!” Lopez-Galvan wrote on Facebook before her show, as she often did.\n\nOnce the show was over, she and her co-host, Tommy Andrade, parted ways — not knowing that it would be their last time together.\n\nPolice said one person was killed and 22 were injured but have not named any of the victims. Their ages range from 8 to 47 years old.\n\nThe shooting stemmed from a dispute among “several” people and spilled into the crowd, police said in a news conference Thursday. Two of those in custody are minors. Police said the shooting had no connection to terrorism.\n\nLopez-Galvan, 43, a mother of two, volunteered on the show before joining as a full-time programmer and co-host about two years ago, said Andrade, her co-host and family friend, remembering her as a kind person with an infectious smile. “She treated everyone she knew and loved as close family,” he told The Washington Post. “She will be missed.”\n\nAccording to Lopez-Galvan’s radio station, her adult son was shot in the leg at the rally but had been released from the hospital.\n\nIn a statement, the Lopez-Galvan family said: “We thank the community for their prayers and support during this difficult time. We are heartbroken with the loss of our loved one … who was an amazing mother, wife, daughter, sister, aunt, cousin, and friend to so many.”\n\n“We ask to please keep our family in your prayers as we grieve the loss of Lisa’s death while also supporting our other loved ones who were impacted in this senseless act,” the statement said.\n\nAbarca choked up as he recalled his conversation Wednesday with one of Lopez-Galvan’s cousins. Both broke down in tears. Then the cousin told him: “What you need to do is do your job and change this.”\n\nThroughout her life, serving others was a key part of Lopez-Galvan’s life — from assisting people who didn’t speak English as a court clerk, to helping people in her community find jobs, according to a 2021 profile in the local newspaper Dos Mundos. She was bilingual in English and Spanish, her profile on KKFI said.\n\nIn an interview with Kansas City Hispanic News late last year, Lopez-Galvan credited her father, who played in local Mexican bands after arriving in Kansas City in his youth, for her love of music.\n\n“I just want to thank him, because if it wasn’t for him and the music I listened to growing up, I wouldn’t have this passion for music,” she said.\n\nThe last Facebook post she wrote before her final show — where she asked for birthdays, anniversaries or other special occasions — has now become a place for people to mourn a woman they never knew.\n\nBut for those who listened or knew her, it’s also a place to remember a kind individual who “always wanted to help others,” as one person wrote."
  },
  {
    "url": "https://www.washingtonpost.com/nation/2024/02/14/superbowl-rally-kansas-city-shooting/?itid=lk_inline_manual_10",
    "headline": "In Kansas City, a tragic end to Super Bowl parade shocks community",
    "publishDate": "2024-02-15T00:51:13.967Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M2YTWVESJGAEDBD2ZOZFJAFIXI_size-normalized.jpg&w=1440",
    "description": "Shots were fired outside Union Station, where the Kansas City Chiefs had just ended a rally with fans celebrating their Super Bowl win.",
    "content": "The violence forced emergency evacuations of the region’s top political leaders gathered for the parade and rally, including the governors of Missouri and Kansas and the mayor of Kansas City, who fled the shots with his wife and mother.\n\nThe incident reverberated around a country still shaken by several recent episodes of high-profile gun violence: In Houston, a woman burst into a megachurch between Sunday services and opened fire; in D. C., three police officers were shot while serving a warrant Wednesday; and just hours later, four students were wounded in a drive-by shooting outside of an Atlanta high school.\n\n“It’s absurd that we cannot celebrate our city’s victory without fearing for our lives at the same time,” Tara Bennett, a volunteer with the Kansas City chapter of Moms Demand Action who was at the parade, said in a statement.\n\nMissouri has among the nation’s highest rates of gun deaths and firearm ownership, according to Everytown for Gun Safety, a gun-safety advocacy group. The state also has some of the weakest gun-control laws in the country and its Republican leadership — who control both chambers of the legislature and the governorship — have shown little interest in passing further restrictions.\n\nAs of late Wednesday, Kansas City police had taken three people into custody and recovered multiple firearms, but they had not identified the suspects or the weapons, nor had they named any of the victims. Lisa Lopez-Galvan, a radio DJ and host of “Taste of Tejano” on Kansas City radio station KKFI, was killed in the shooting, according to Tommy Andrade, a family friend and co-host of the show. Andrade said Lopez-Galvan’s husband, Mike, informed him of her death. The station put out a statement calling her death a “senseless act.”\n\nGraves and other city leaders praised the parade’s security measures and the police response, saying the hundreds of officers already on the scene acted fast and prevented further bloodshed. The shooting occurred, despite the heavy police presence, because of “bad actors,” Graves said.\n\nWednesday’s festivities marked Kansas City’s third Super Bowl victory in five years, and the day’s party started off just like the others. Fans arrived early on an unseasonably warm Midwest day. They lined the streets, draped in Chiefs gear, holding signs and waving team flags as they jockeyed for position, trying to catch a glimpse of the players as they bounded past.\n\nLocal hero and star quarterback Patrick Mahomes swaggered down the parade route, slapping hands with fans and unzipping his jacket to show off a bare chest. Travis Kelce, the team’s all-pro tight end and boyfriend to Taylor Swift, dropped to one knee and chugged a beer as the crowd around him roared.\n\nPolice responded to the first shots shortly after the team’s players and coaches delivered remarks at the rally outside the train station. Videos posted on social media showed spectators rushing from the area as police ran inside the historic building. Other videos showed responders aiding victims on the ground outside.\n\nKansas City interim fire chief Ross Grundyson told reporters that of the 21 injured victims, eight had “immediately life-threatening” injuries and seven had “life-threatening injuries.” Six others were considered to have “minor” injuries. A spokesperson for Kansas City’s Children’s Mercy hospital confirmed to The Washington Post that the facility was treating 12 patients from the shooting, 11 of whom were children.\n\n“For this joy to be turned to tragedy today in Kansas City cuts deep in the American soul,” he said. “Today’s events should move us, shock us, shame us into acting. What are we waiting for? What else do we need to see? How many more families need to be torn apart?”\n\nMissouri Gov. Mike Parson (R), who attended the parade with his wife, said it was a “tragic conclusion to a celebration we had all looked forward to.” And Gov. Laura Kelly (D) of Kansas said she was evacuated and that the “senseless act of violence goes against everything Kansas City and the Chiefs Kingdom stand for.”"
  },
  {
    "url": "http://www.washingtonpost.com/nation/2024/02/15/kansas-city-chiefs-parade-shooting-fears/?itid=co_paradeshooting_3",
    "headline": "Kansas City and Chiefs fans mourn after another public tragedy",
    "publishDate": "2024-02-16T00:15:41.376Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2VNCU5XS6UMTXBCXPXIWZ4P3CM_size-normalized.jpg&w=1440",
    "description": "One person died and more than 20 others were wounded when gunfire broke out at the end of a rally for the Chiefs’ Super Bowl victory",
    "content": "Police said Thursday that they were sorting out why gunfire erupted between several people at the conclusion of Wednesday’s rally for the Chiefs, leaving one Johnson County mother of two dead and more than 20 with gunshot wounds, at least half of them under age 16. Two juveniles were in police custody Thursday as the investigation continued, police said.\n\nThe city’s mayor, Quinton Lucas (D), said in interviews that while a St. Patrick’s Day parade next month would continue as scheduled, the city may have to contemplate holding a much smaller rally at Arrowhead Stadium if the Chiefs win another Super Bowl so fans can be sent through metal detectors beforehand.\n\nWith parades planned for St. Patrick’s Day next month, “my city and many American cities will be tested,” Lucas said. “Is this just something we live with in the same way that we’re living with school shootings and the threat to movie theaters and the threat to bowling alleys?”\n\nLucas said he had spoken Thursday morning with Illinois Gov. J. B. Pritzker (D) about a 2022 shooting — allegedly by a 21-year-old man armed with an semiautomatic rifle — that left seven people dead and several dozen wounded at a Fourth of July parade in Highland Park. Lucas said he told Pritzker that “I shouldn’t be surprised that something like this could happen at a parade or rally, but you always are.”\n\nThe tragedy seemed to hit especially hard in Kansas City, a smaller market which has always had an outsize love for its National Football League team — even in the lean years between Super Bowl appearances and before the white-hot attention drawn by tight end Travis Kelce’s romance with musician Taylor Swift. Local reporters covering the shooting Wednesday wept during their standups, and morning radio shows Thursday turned into therapy sessions for heartbroken fans.\n\n“This isn’t Kansas City,” grieving residents said over and over, echoing the words Wednesday of the city’s police chief. But, in a way, it is — the city has long suffered from gang violence and hit a record number of homicides last year at 184. Just last month, a shooting between parties at a food court in the mall just steps from the rally grounds left six injured.\n\nIn the chaos following Wednesday’s violence, panicked fans scaled barricades and took refuge in the city’s iconic Union Station, where the public officials and Chiefs players and coaches had been rushed for their safety. The famous and their fans huddled, barricaded in rooms and trying to comfort children separated from their parents.\n\n“This is SAD man! Kids are being shot and somebody didn’t come home tonight,” Chiefs safety Justin Reid wrote on X, formerly known as Twitter. “We cannot allow this to be normal. We cannot [allow] ourselves to become numb and chalk it up to ‘just another shooting in America’ and reduce people in statistics and then move on tmrw.\n\nAfterward, Abarca, 35, texted the county’s general counsel and said he wanted the attorney to draft language on gun control measures within days, no matter that by state law, localities may not be able to enact such changes. “We cannot just sit here and do nothing,” he said.\n\nThe Chiefs’ parades — which wind through downtown Kansas City and end up with a rally at Union Station — are rowdy affairs, with the players jumping off the buses to mingle with the fans on the sidelines, signing autographs and high-fiving. Footballs arc through the air, and plenty of alcohol is consumed by players and spectators.\n\nIn that climate, he said, tensions between people can quickly erupt into violence. “When you have actors who don’t have any regard for the safety of other individuals and they’re just thinking of their own beef, then these things can happen,” he said."
  },
  {
    "url": "http://www.washingtonpost.com/nation/2024/02/16/kansas-city-parade-shooting-timeline/?itid=co_paradeshooting_2",
    "headline": "From jubilation to chaos, here’s how the Kansas City shooting unfolded",
    "publishDate": "2024-02-16T11:00:41.729Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KW226AGBXBGDRK6BHGD4QXQAVA.jpg&w=1440",
    "description": "At the end of Wednesday’s parade celebrating the Chiefs’ Super Bowl win, fans in Kansas City, Mo., heard the same sound that has haunted celebrations across America: gunshots.",
    "content": "Accessibility statementSkip to main content\n\nFrom jubilation to chaos, here’s how the Kansas City shooting unfoldedThe shooting broke out as thousands of fans gathered to celebrate Kansas City’s Super Bowl victory on Feb. 14. (Video: The Washington Post)Kansas City, Mo., had pulled off this celebration before. Thousands of people wearing Chiefs jerseys lined the streets and showered their hometown team with feverish fanfare in celebration of another Super Bowl win as red, white and yellow confetti fell around them. They’d jumped up and down, cheering loudly with their hands in the air to give the Kansas City Chiefs another memorable homecoming — the team’s third in the last five years.The “Chiefs Kingdom” watched excitedly as players made their way through the two-mile-long route in downtown, ending at Union Station, where they gave rousing speeches to a red-clad crowd. It was a day for Kansas City to celebrate back-to-back Super Bowl wins — a feat that hadn’t been achieved in nearly two decades.But at the rally’s end that afternoon, Kansas City fans heard the same sound that has transformed other American celebrations into nightmares: gunshots.After the Chiefs’ championship win, Kansas City officials knew fans would come out in droves to celebrate.Authorities posted information online about reunification sites ahead of the parade as they planned for the possibility of people losing track of each other in a crowd that they expected would be bigger than last year’s.Officials began closing down roads on Tuesday. By the next morning, hundreds of police officers were stationed along the route and around Union Station.Kansas City Chiefs tight end Travis Kelce sang to the crowd at the team’s Super Bowl parade. (Video: AP)Around 11 a.m., Chiefs’ players started their journey toward Union Station, where they would address Kansas City faithfuls at a victory rally. The team rode atop red double-decker buses with “world champions” emblazoned in bold white font, driving slowly by hundreds of thousands of fans who had waited all morning to see them.It was “Party time again!” as the Kansas City Star had put it on that morning’s front page headline. That energy was palpable in every sign that was held, every flag that was waved, every cheer that was shouted. All morning, the city sang, danced and welcomed back its team.Near the end of the parade, fans crowded around Union Station to hear from the victors in the parade’s finale.“Chiefs Kingdom, y’all are the reason that we do what we do,” quarterback Patrick Mahomes told the crowd.Kansas City fans had gathered close together, forming a sea of red as they listened to the speeches.But, soon, they would splinter in every direction.‘It seems like almost nothing is safe.’At first, some thought the noise that erupted around 2 p.m. was fireworks.But the volley of gunfire continued, sending paradegoers sprinting away from the sound of gunfire. Some dropped to the ground, trying to take cover behind railings or cardboard boxes. Within moments, a day that had started with sheer joy spiraled into a shocking tragedy.“It seems like almost nothing is safe,” Kansas City Mayor Quinton Lucas (D) said.Around 2 p.m. Central time on Feb. 14, shots rang out while terrified fans fled the area. (Video: Anonymous via Storyful)Police who were already staged around the parade rushed to the scene. Fans continued to flee, crushing regalia and confetti strewn on the concrete in their wake.Police officers are seen running toward the scene of the shooting at Union Station in Kansas City, Mo., on Feb. 14. (Video: AP)During the chaos, someone in the crowd yelled “Get him!”A group of fans nearby ran and tackled one of the three people who was later detained by police, Trey Filter, one of the bystanders, recalled.Fans tackled an alleged shooter as he was running through the crowd on Feb. 14. (Video: Christopher A & Alyssa Marsh-Contreras via Storyful)Police on Thursday said the shooting stemmed from a personal dispute among several people. One person was killed and at least 22 others were injured in the incident, officials said. Of those injured, half were under 16 years old.Lucas, the Kansas City mayor, was one of several politicians in attendance. He later described how he, along with his wife and mother, had to run for safety as they heard the gunshots erupt.“This is a day that a lot of people look forward to, something they remember for a lifetime,” Lucas said. “And what they shouldn’t have to remember is the threat of gun violence marring a day like this.”Police reported shots fired, saying “multiple people were struck” at Union Station in Kansas City, Mo., following speeches by the Kansas City Chiefs on Feb. 14. (Video: AP)‘She was so full of life’On Wednesday, local radio station KKFI 90.1 FM confirmed that Elizabeth “Lisa” Lopez-Galvan, one of its hosts, died in the shooting. Lopez-Galvan, who was also a DJ for special occasions in the community and “did everybody’s wedding,” had been known for her contagious smile and laugh.“She was so full of life,” Lisa Lopez, a longtime friend of Lopez-Galvan, told the Kansas City Star.Tommy Andrade said Lopez-Galvan, his friend and co-host, “treated everyone she knew and loved as close family.”Lopez-Galvan had gone to the parade with her adult son, who was shot in the leg, according to KKFI. Her family has been heartbroken, they said in a statement, calling her an “amazing mother, wife, daughter, sister, aunt, cousin, and friend to so many.”As of Thursday evening, authorities had yet to file any charges or identify what firearms they had recovered from the scene.As they continue to investigate, questions surrounding the incident have left Kansas City residents wondering how their home became the latest in a long list of places turned upside down by gun violence.First responders arrive after a shooting in Kansas City, Mo., on Feb. 14. (Video: The Washington Post)Chiefs fans and players asked those same questions as they took to social media after the parade.“When are we going to fix these gun laws?” Chiefs defensive end Charles Omenihu wrote in one post.Wednesday’s shooting marked the most recent example of gun violence in the United States, which many regard as an aspect that has become an all-too-common part of living in America. It had scarred what was supposed to be a day of celebration in Kansas City, the way it had at schools, rallies and movie theaters across the country, Lucas said.“I wish we lived in a world where we wouldn’t have to see incidents like that,” he said.But by day’s end, it was much quieter, with crinkled confetti and crushed cans on the ground, surrounded by yellow police tape."
  }
]