{
    "url": "https://www.washingtonpost.com/nation/2024/02/15/kansas-city-parade-shooting-victims-lisa-lopez-galvan/?itid=lk_inline_manual_46",
    "headline": "Beloved DJ Lisa Lopez-Galvan killed in Kansas City parade shooting",
    "publishDate": "2024-02-15T15:35:04.826Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/R72N64NPVFHCVIZMIJWHQVDRZU.JPG&w=1440",
    "description": "A shooting near the Kansas City Chiefs’ Super Bowl parade killed one person and injured 22. Lisa Lopez-Galvan’s radio station, KKFI, announced her death.",
    "content": "It was just like any other Tuesday night. Elizabeth “Lisa” Lopez-Galvan was on air for her weekly radio show, “A Taste of Tejano,” sharing her love of music. The program features Tejano music, a “Tex-Mex” fusion of Mexican and American musical influences.“Let us know if you have a birthday, anniversary or special announcement!” Lopez-Galvan wrote on Facebook before her show, as she often did.\n\nOnce the show was over, she and her co-host, Tommy Andrade, parted ways — not knowing that it would be their last time together.\n\nPolice said one person was killed and 22 were injured but have not named any of the victims. Their ages range from 8 to 47 years old.\n\nThe shooting stemmed from a dispute among “several” people and spilled into the crowd, police said in a news conference Thursday. Two of those in custody are minors. Police said the shooting had no connection to terrorism.\n\nLopez-Galvan, 43, a mother of two, volunteered on the show before joining as a full-time programmer and co-host about two years ago, said Andrade, her co-host and family friend, remembering her as a kind person with an infectious smile. “She treated everyone she knew and loved as close family,” he told The Washington Post. “She will be missed.”\n\nAccording to Lopez-Galvan’s radio station, her adult son was shot in the leg at the rally but had been released from the hospital.\n\nIn a statement, the Lopez-Galvan family said: “We thank the community for their prayers and support during this difficult time. We are heartbroken with the loss of our loved one … who was an amazing mother, wife, daughter, sister, aunt, cousin, and friend to so many.”\n\n“We ask to please keep our family in your prayers as we grieve the loss of Lisa’s death while also supporting our other loved ones who were impacted in this senseless act,” the statement said.\n\nAbarca choked up as he recalled his conversation Wednesday with one of Lopez-Galvan’s cousins. Both broke down in tears. Then the cousin told him: “What you need to do is do your job and change this.”\n\nThroughout her life, serving others was a key part of Lopez-Galvan’s life — from assisting people who didn’t speak English as a court clerk, to helping people in her community find jobs, according to a 2021 profile in the local newspaper Dos Mundos. She was bilingual in English and Spanish, her profile on KKFI said.\n\nIn an interview with Kansas City Hispanic News late last year, Lopez-Galvan credited her father, who played in local Mexican bands after arriving in Kansas City in his youth, for her love of music.\n\n“I just want to thank him, because if it wasn’t for him and the music I listened to growing up, I wouldn’t have this passion for music,” she said.\n\nThe last Facebook post she wrote before her final show — where she asked for birthdays, anniversaries or other special occasions — has now become a place for people to mourn a woman they never knew.\n\nBut for those who listened or knew her, it’s also a place to remember a kind individual who “always wanted to help others,” as one person wrote."
}