{
    "url": "https://www.washingtonpost.com/nation/2024/02/15/kansas-city-shooting-bystanders-tackle-suspect/?itid=lk_inline_manual_36",
    "headline": "Chiefs fans tackled suspect after parade shooting",
    "publishDate": "2024-02-15T20:55:22.676Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6AMUOFFNMDX6CQUNQXVYUZ4WKA_size-normalized.jpg&w=1440",
    "description": "Fast-acting Chiefs fans are being credited with springing into action as the Super Bowl rally and parade turned to chaos with a shooting that killed one woman.",
    "content": "As Trey Filter’s family left the rally celebrating the Kansas City Chiefs’ Super Bowl win Wednesday, his son asked him if the loud bangs they were hearing were gunshots. Filter said no, figuring they were celebratory firecrackers. Moments later, Filter heard someone in the crowd yell, “Get him!” He saw a flash to his left, a man running by. Filter jumped on him, hoping it was the right person.\n\nHe and other bystanders tackled one of the three people detained by police for the shooting, and Filter’s wife, Casey, picked up a gun that landed near the suspect and moved it away, the couple recounted Thursday on “Good Morning America.” They, fellow fast-acting Chiefs fan Paul Contreras and other bystanders are being credited with springing into action as the celebration turned to chaos.\n\nThe gunfire broke out as the Kansas City Chiefs’ Super Bowl victory parade was wrapping up. One person, a radio DJ and mother of two, was killed and 22 were wounded by gunshots.\n\nThe shooting appeared to have resulted from a dispute among several people and was not an instance of terrorism or extremism, authorities said Thursday. Three people were detained by police, two of whom are minors, and are under investigation in the incident. No arrests have been made so far.\n\nWitness video verified by Storyful showed a small crowd fleeing as the suspected gunman ran down a grassy sideline area while bystanders pursued and then tackled him. The bystanders appeared to bring down one of the suspected gunmen, wrestling him to the ground and pinning him down until police arrived moments later.\n\n“They helped one another and even physically stopped a person who was believed to be involved in the incident,” Graves said. “I want to thank the people who acted bravely yesterday alongside law enforcement. … Your selfless act did not go unnoticed.”\n\nThe Filters, Contreras and Contreras’s daughter, Alyssa Marsh-Contreras, have given multiple interviews on local and national television recounting their stories since the incident Wednesday. They were not immediately available for comment Thursday.\n\nContreras and his three daughters were walking back to their car when they heard the gunshots, which they also thought were fireworks until they heard shouts, he recounted. Contreras jumped on the man, like others nearby. It all happened in seconds.\n\nAs he tackled the man, Contreras told local television station KETV, “I see his weapon either fell out of his hand or his sleeve.”\n\nStanding next to them, Casey Filter saw the gun on the ground. At first, she thought it was a toy.\n\n“But then, once I picked it up, I realized it definitely was not,” she told GMA. She described it as “an AK” to Fox News.\n\nThose crowded around the man waited for police to arrive, still in shock. Marsh-Contreras said she thought the suspect was in his late teens.\n\n“They just kept him down” until the police came, she said, describing the situation as “very scary.”\n\n“You can’t be scared,” he said. “Not saying that you want it to happen, but there’s always that chance. It could happen at work, anywhere, the grocery store.”"
}