{
    "url": "http://www.washingtonpost.com/nation/2024/02/16/kansas-city-parade-shooting-timeline/?itid=co_paradeshooting_2",
    "headline": "From jubilation to chaos, here’s how the Kansas City shooting unfolded",
    "publishDate": "2024-02-16T11:00:41.729Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KW226AGBXBGDRK6BHGD4QXQAVA.jpg&w=1440",
    "description": "At the end of Wednesday’s parade celebrating the Chiefs’ Super Bowl win, fans in Kansas City, Mo., heard the same sound that has haunted celebrations across America: gunshots.",
    "content": "Accessibility statementSkip to main content\n\nFrom jubilation to chaos, here’s how the Kansas City shooting unfoldedThe shooting broke out as thousands of fans gathered to celebrate Kansas City’s Super Bowl victory on Feb. 14. (Video: The Washington Post)Kansas City, Mo., had pulled off this celebration before. Thousands of people wearing Chiefs jerseys lined the streets and showered their hometown team with feverish fanfare in celebration of another Super Bowl win as red, white and yellow confetti fell around them. They’d jumped up and down, cheering loudly with their hands in the air to give the Kansas City Chiefs another memorable homecoming — the team’s third in the last five years.The “Chiefs Kingdom” watched excitedly as players made their way through the two-mile-long route in downtown, ending at Union Station, where they gave rousing speeches to a red-clad crowd. It was a day for Kansas City to celebrate back-to-back Super Bowl wins — a feat that hadn’t been achieved in nearly two decades.But at the rally’s end that afternoon, Kansas City fans heard the same sound that has transformed other American celebrations into nightmares: gunshots.After the Chiefs’ championship win, Kansas City officials knew fans would come out in droves to celebrate.Authorities posted information online about reunification sites ahead of the parade as they planned for the possibility of people losing track of each other in a crowd that they expected would be bigger than last year’s.Officials began closing down roads on Tuesday. By the next morning, hundreds of police officers were stationed along the route and around Union Station.Kansas City Chiefs tight end Travis Kelce sang to the crowd at the team’s Super Bowl parade. (Video: AP)Around 11 a.m., Chiefs’ players started their journey toward Union Station, where they would address Kansas City faithfuls at a victory rally. The team rode atop red double-decker buses with “world champions” emblazoned in bold white font, driving slowly by hundreds of thousands of fans who had waited all morning to see them.It was “Party time again!” as the Kansas City Star had put it on that morning’s front page headline. That energy was palpable in every sign that was held, every flag that was waved, every cheer that was shouted. All morning, the city sang, danced and welcomed back its team.Near the end of the parade, fans crowded around Union Station to hear from the victors in the parade’s finale.“Chiefs Kingdom, y’all are the reason that we do what we do,” quarterback Patrick Mahomes told the crowd.Kansas City fans had gathered close together, forming a sea of red as they listened to the speeches.But, soon, they would splinter in every direction.‘It seems like almost nothing is safe.’At first, some thought the noise that erupted around 2 p.m. was fireworks.But the volley of gunfire continued, sending paradegoers sprinting away from the sound of gunfire. Some dropped to the ground, trying to take cover behind railings or cardboard boxes. Within moments, a day that had started with sheer joy spiraled into a shocking tragedy.“It seems like almost nothing is safe,” Kansas City Mayor Quinton Lucas (D) said.Around 2 p.m. Central time on Feb. 14, shots rang out while terrified fans fled the area. (Video: Anonymous via Storyful)Police who were already staged around the parade rushed to the scene. Fans continued to flee, crushing regalia and confetti strewn on the concrete in their wake.Police officers are seen running toward the scene of the shooting at Union Station in Kansas City, Mo., on Feb. 14. (Video: AP)During the chaos, someone in the crowd yelled “Get him!”A group of fans nearby ran and tackled one of the three people who was later detained by police, Trey Filter, one of the bystanders, recalled.Fans tackled an alleged shooter as he was running through the crowd on Feb. 14. (Video: Christopher A & Alyssa Marsh-Contreras via Storyful)Police on Thursday said the shooting stemmed from a personal dispute among several people. One person was killed and at least 22 others were injured in the incident, officials said. Of those injured, half were under 16 years old.Lucas, the Kansas City mayor, was one of several politicians in attendance. He later described how he, along with his wife and mother, had to run for safety as they heard the gunshots erupt.“This is a day that a lot of people look forward to, something they remember for a lifetime,” Lucas said. “And what they shouldn’t have to remember is the threat of gun violence marring a day like this.”Police reported shots fired, saying “multiple people were struck” at Union Station in Kansas City, Mo., following speeches by the Kansas City Chiefs on Feb. 14. (Video: AP)‘She was so full of life’On Wednesday, local radio station KKFI 90.1 FM confirmed that Elizabeth “Lisa” Lopez-Galvan, one of its hosts, died in the shooting. Lopez-Galvan, who was also a DJ for special occasions in the community and “did everybody’s wedding,” had been known for her contagious smile and laugh.“She was so full of life,” Lisa Lopez, a longtime friend of Lopez-Galvan, told the Kansas City Star.Tommy Andrade said Lopez-Galvan, his friend and co-host, “treated everyone she knew and loved as close family.”Lopez-Galvan had gone to the parade with her adult son, who was shot in the leg, according to KKFI. Her family has been heartbroken, they said in a statement, calling her an “amazing mother, wife, daughter, sister, aunt, cousin, and friend to so many.”As of Thursday evening, authorities had yet to file any charges or identify what firearms they had recovered from the scene.As they continue to investigate, questions surrounding the incident have left Kansas City residents wondering how their home became the latest in a long list of places turned upside down by gun violence.First responders arrive after a shooting in Kansas City, Mo., on Feb. 14. (Video: The Washington Post)Chiefs fans and players asked those same questions as they took to social media after the parade.“When are we going to fix these gun laws?” Chiefs defensive end Charles Omenihu wrote in one post.Wednesday’s shooting marked the most recent example of gun violence in the United States, which many regard as an aspect that has become an all-too-common part of living in America. It had scarred what was supposed to be a day of celebration in Kansas City, the way it had at schools, rallies and movie theaters across the country, Lucas said.“I wish we lived in a world where we wouldn’t have to see incidents like that,” he said.But by day’s end, it was much quieter, with crinkled confetti and crushed cans on the ground, surrounded by yellow police tape."
}