{
    "url": "https://www.washingtonpost.com/nation/2024/02/14/superbowl-rally-kansas-city-shooting/?itid=lk_inline_manual_10",
    "headline": "In Kansas City, a tragic end to Super Bowl parade shocks community",
    "publishDate": "2024-02-15T00:51:13.967Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M2YTWVESJGAEDBD2ZOZFJAFIXI_size-normalized.jpg&w=1440",
    "description": "Shots were fired outside Union Station, where the Kansas City Chiefs had just ended a rally with fans celebrating their Super Bowl win.",
    "content": "The violence forced emergency evacuations of the region’s top political leaders gathered for the parade and rally, including the governors of Missouri and Kansas and the mayor of Kansas City, who fled the shots with his wife and mother.\n\nThe incident reverberated around a country still shaken by several recent episodes of high-profile gun violence: In Houston, a woman burst into a megachurch between Sunday services and opened fire; in D. C., three police officers were shot while serving a warrant Wednesday; and just hours later, four students were wounded in a drive-by shooting outside of an Atlanta high school.\n\n“It’s absurd that we cannot celebrate our city’s victory without fearing for our lives at the same time,” Tara Bennett, a volunteer with the Kansas City chapter of Moms Demand Action who was at the parade, said in a statement.\n\nMissouri has among the nation’s highest rates of gun deaths and firearm ownership, according to Everytown for Gun Safety, a gun-safety advocacy group. The state also has some of the weakest gun-control laws in the country and its Republican leadership — who control both chambers of the legislature and the governorship — have shown little interest in passing further restrictions.\n\nAs of late Wednesday, Kansas City police had taken three people into custody and recovered multiple firearms, but they had not identified the suspects or the weapons, nor had they named any of the victims. Lisa Lopez-Galvan, a radio DJ and host of “Taste of Tejano” on Kansas City radio station KKFI, was killed in the shooting, according to Tommy Andrade, a family friend and co-host of the show. Andrade said Lopez-Galvan’s husband, Mike, informed him of her death. The station put out a statement calling her death a “senseless act.”\n\nGraves and other city leaders praised the parade’s security measures and the police response, saying the hundreds of officers already on the scene acted fast and prevented further bloodshed. The shooting occurred, despite the heavy police presence, because of “bad actors,” Graves said.\n\nWednesday’s festivities marked Kansas City’s third Super Bowl victory in five years, and the day’s party started off just like the others. Fans arrived early on an unseasonably warm Midwest day. They lined the streets, draped in Chiefs gear, holding signs and waving team flags as they jockeyed for position, trying to catch a glimpse of the players as they bounded past.\n\nLocal hero and star quarterback Patrick Mahomes swaggered down the parade route, slapping hands with fans and unzipping his jacket to show off a bare chest. Travis Kelce, the team’s all-pro tight end and boyfriend to Taylor Swift, dropped to one knee and chugged a beer as the crowd around him roared.\n\nPolice responded to the first shots shortly after the team’s players and coaches delivered remarks at the rally outside the train station. Videos posted on social media showed spectators rushing from the area as police ran inside the historic building. Other videos showed responders aiding victims on the ground outside.\n\nKansas City interim fire chief Ross Grundyson told reporters that of the 21 injured victims, eight had “immediately life-threatening” injuries and seven had “life-threatening injuries.” Six others were considered to have “minor” injuries. A spokesperson for Kansas City’s Children’s Mercy hospital confirmed to The Washington Post that the facility was treating 12 patients from the shooting, 11 of whom were children.\n\n“For this joy to be turned to tragedy today in Kansas City cuts deep in the American soul,” he said. “Today’s events should move us, shock us, shame us into acting. What are we waiting for? What else do we need to see? How many more families need to be torn apart?”\n\nMissouri Gov. Mike Parson (R), who attended the parade with his wife, said it was a “tragic conclusion to a celebration we had all looked forward to.” And Gov. Laura Kelly (D) of Kansas said she was evacuated and that the “senseless act of violence goes against everything Kansas City and the Chiefs Kingdom stand for.”"
}