{
    "url": "https://www.washingtonpost.com/nation/2024/02/15/kansas-city-shooting-super-bowl-rally/?itid=lk_inline_manual_10",
    "headline": "Kansas City shooting stemmed from personal dispute, officials say",
    "publishDate": "2024-02-15T16:35:50.344Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UNAUSYDJPNOFQL4RVAAPIYD6DA_size-normalized.jpg&w=1440",
    "description": "The shooting, which police say stemmed from a personal dispute, left one woman dead and 22 people injured as the celebration for the Super Bowl champion Chiefs ended.",
    "content": "The deadly shooting that turned a celebration for the Kansas City Chiefs into a tragedy on Wednesday appeared to stem from a dispute among several people and had “no nexus to terrorism or homegrown violent extremism,” officials said Thursday morning. Kansas City Police Chief Stacey Graves said at a briefing that two of three people detained are juveniles. None has been charged yet, and additional detentions or arrests are possible, she said.\n\nThe shooting occurred about 2 p.m. amid a crowd of fans outside the city’s Union Station as the parade and rally for the Super Bowl champions drew to a close. At the sound of gunfire, people fled in every direction while police and first responders began swarming the scene. The three people were taken into custody a short time later.\n\nOne woman was killed and 22 people were injured in a matter of minutes. The victims’ ages range from 8 to 47, Graves said, and at least half are younger than 16.\n\n“This incident is still a very active investigation,” she noted. Authorities must charge the people in custody within 24 hours or release them, she said, adding that “we have all intentions of presenting charges.”\n\nA statement from the University Health hospital in Kansas City said three gunshot victims remained there Thursday, including two in critical condition. Saint Luke’s Hospital of Kansas City was continuing to treat one victim, who was still listed as in critical condition Thursday. Children’s Mercy had received a dozen victims, nine with gunshot wounds, in the aftermath of the rally. All are expected to recover, according to a hospital spokesperson.\n\nThe city continued to clean up the scene, which was still littered Thursday morning after with fans’ folding chairs, Chiefs regalia, and red and yellow confetti. The Jackson County prosecutor’s office was offering counseling services for members of the public feeling traumatized by what they had witnessed.\n\n“We are seeing more things with a lot of people getting hit, even unintentionally. I’m not going to get ahead of the facts here, but it is something that I think is a very real concern,” he said.\n\n“I’d be lying to you if I didn’t say that we’ll probably evaluate in the event that we’re blessed to have another Super Bowl championship,” Lucas said in an interview Thursday morning, wondering whether future gatherings would need to be held at a stadium or other location where attendees would be wanded at security checkpoints.\n\nThe shooting was the latest to upend a community’s celebration with deadly violence. And with parades coming up on St. Patrick’s Day next month, “my city and many American cities will be tested,” Lucas said. “Is this just something we live with in the same way that we’re living with school shootings and the threat to movie theaters and the threat to bowling alleys?”\n\nLucas said he had spoken Thursday morning with Illinois Gov. J. B. Pritzker (D) about a 2022 shooting — allegedly by a 21-year-old man armed with an semiautomatic rifle — that left seven people dead and several dozen wounded at a Fourth of July parade in Highland Park, Ill. Lucas said he told Pritzker that “I shouldn’t be surprised that something like this could happen at a parade or rally, but you always are.”\n\nOne security expert, Michael Chertoff, former secretary of the federal Department of Homeland Security, also raised the issue of ensuring safety with such open events. In a stadium, he noted, “you can screen people for bringing in weapons or things that are dangerous, potential bombs. And you also can funnel them in through a portal that gives you control over everybody who comes in. Obviously, when you’re dealing with the street, you don’t have that capability.”\n\nOfficials declined Thursday to comment on the kinds of weapons used in the parade shooting. Missouri, which has some of the nation’s laxest gun laws, has no age minimum for possession of a firearm, though federal law prohibits minors from possessing handguns except in rare circumstances. A bill that Missouri legislators passed three years ago declared federal gun laws invalid and prohibited state and local authorities from enforcing them, but that law is tied up in court.\n\nThe Kansas City Council last August passed two ordinances to strengthen gun laws in the city. One measure banned specific weapons, including machine guns, firearm silencers and components, such as bump stocks, that turn semiautomatic guns into fully automatic weapons. The other prohibited the transfer of weapons, including ammunition, to minors. The mayor said at the time that he believed the ordinances complied with state law."
}