{
    "url": "http://www.washingtonpost.com/nation/2024/02/15/kansas-city-chiefs-parade-shooting-fears/?itid=co_paradeshooting_3",
    "headline": "Kansas City and Chiefs fans mourn after another public tragedy",
    "publishDate": "2024-02-16T00:15:41.376Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2VNCU5XS6UMTXBCXPXIWZ4P3CM_size-normalized.jpg&w=1440",
    "description": "One person died and more than 20 others were wounded when gunfire broke out at the end of a rally for the Chiefs’ Super Bowl victory",
    "content": "Police said Thursday that they were sorting out why gunfire erupted between several people at the conclusion of Wednesday’s rally for the Chiefs, leaving one Johnson County mother of two dead and more than 20 with gunshot wounds, at least half of them under age 16. Two juveniles were in police custody Thursday as the investigation continued, police said.\n\nThe city’s mayor, Quinton Lucas (D), said in interviews that while a St. Patrick’s Day parade next month would continue as scheduled, the city may have to contemplate holding a much smaller rally at Arrowhead Stadium if the Chiefs win another Super Bowl so fans can be sent through metal detectors beforehand.\n\nWith parades planned for St. Patrick’s Day next month, “my city and many American cities will be tested,” Lucas said. “Is this just something we live with in the same way that we’re living with school shootings and the threat to movie theaters and the threat to bowling alleys?”\n\nLucas said he had spoken Thursday morning with Illinois Gov. J. B. Pritzker (D) about a 2022 shooting — allegedly by a 21-year-old man armed with an semiautomatic rifle — that left seven people dead and several dozen wounded at a Fourth of July parade in Highland Park. Lucas said he told Pritzker that “I shouldn’t be surprised that something like this could happen at a parade or rally, but you always are.”\n\nThe tragedy seemed to hit especially hard in Kansas City, a smaller market which has always had an outsize love for its National Football League team — even in the lean years between Super Bowl appearances and before the white-hot attention drawn by tight end Travis Kelce’s romance with musician Taylor Swift. Local reporters covering the shooting Wednesday wept during their standups, and morning radio shows Thursday turned into therapy sessions for heartbroken fans.\n\n“This isn’t Kansas City,” grieving residents said over and over, echoing the words Wednesday of the city’s police chief. But, in a way, it is — the city has long suffered from gang violence and hit a record number of homicides last year at 184. Just last month, a shooting between parties at a food court in the mall just steps from the rally grounds left six injured.\n\nIn the chaos following Wednesday’s violence, panicked fans scaled barricades and took refuge in the city’s iconic Union Station, where the public officials and Chiefs players and coaches had been rushed for their safety. The famous and their fans huddled, barricaded in rooms and trying to comfort children separated from their parents.\n\n“This is SAD man! Kids are being shot and somebody didn’t come home tonight,” Chiefs safety Justin Reid wrote on X, formerly known as Twitter. “We cannot allow this to be normal. We cannot [allow] ourselves to become numb and chalk it up to ‘just another shooting in America’ and reduce people in statistics and then move on tmrw.\n\nAfterward, Abarca, 35, texted the county’s general counsel and said he wanted the attorney to draft language on gun control measures within days, no matter that by state law, localities may not be able to enact such changes. “We cannot just sit here and do nothing,” he said.\n\nThe Chiefs’ parades — which wind through downtown Kansas City and end up with a rally at Union Station — are rowdy affairs, with the players jumping off the buses to mingle with the fans on the sidelines, signing autographs and high-fiving. Footballs arc through the air, and plenty of alcohol is consumed by players and spectators.\n\nIn that climate, he said, tensions between people can quickly erupt into violence. “When you have actors who don’t have any regard for the safety of other individuals and they’re just thinking of their own beef, then these things can happen,” he said."
}