{
    "url": "https://www.washingtonpost.com/nation/2024/02/16/kansas-city-shooting-charges/?itid=lk_inline_manual_9",
    "headline": "Two juveniles charged after Kansas City Super Bowl parade shooting",
    "publishDate": "2024-02-16T20:14:35.182Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M2YTWVESJGAEDBD2ZOZFJAFIXI_size-normalized.jpg&w=1440",
    "description": "One woman was killed and more than 20 others wounded as gunfire exploded after a rally held to honor the Chiefs’ Sunday victory over the San Francisco 49ers",
    "content": "LAWRENCE, Kan. — Two juveniles held after gunfire exploded at the end of a crowded rally for the Kansas City Chiefs’ Super Bowl victory — killing one and injuring nearly two dozen others — have been criminally charged, authorities said Friday. They were charged Thursday with gun-related offenses and resisting arrest, Jackson County family court officials said in a statement. The two were being held in a juvenile detention facility.\n\nWhat police described as a dispute among several people outside the city’s Union Station on Wednesday sent fans scattering and fleeing over barricades as police and first responders — some 800 were on hand — descended upon the chaotic scene. Three people were taken into custody — including one who was tackled by Chiefs fans — a short time later. An adult detainee was later released.\n\nSgt. Jacob P. Becchina, a spokesman for the Kansas City Police Department, said in an email Friday that the teens had been held as authorities worked with juvenile prosecutors to determine the charges. The juvenile court system will determine their custody status, Becchina said.\n\nThe statement said that while the juveniles had been detained on “gun-related and resisting arrest” charges, “additional charges are expected in the future as the investigation by the Kansas City Police Department continues.”\n\nPolice have not revealed details about guns used in the shooting, besides saying several weapons were recovered. Mayor Quinton Lucas told The Washington Post in an interview Thursday that the “biggest challenge” for police in his Missouri city is the modification of firearms as well as “the ongoing presence of semiautomatic weapons.”\n\nOn Friday, musician Taylor Swift — who is dating Chiefs tight end Travis Kelce — donated $100,000 to the family of Elizabeth “Lisa” Lopez-Galvan, the Johnson County woman who was killed Wednesday afternoon.\n\nLopez-Galvan, 43, a mother of two adult children, was a popular local DJ who hosted a program called “A Taste of Tejano” on the Kansas City radio station KKFI. The trade publication Variety first reported the donation, and the Associated Press verified the posts.\n\n“Sending my deepest sympathies and condolences in the wake of your devastating loss. With love, Taylor Swift,” the singer wrote on the Lopez-Galvan’s memorial GoFundMe page.\n\nThe shooting devastated the Kansas City community, and came at the end of what was a storybook season for the Chiefs, after the team overcame initial struggles to take its second consecutive Super Bowl title in an overtime victory against the San Francisco 49ers.\n\nOn Friday, quarterback Patrick Mahomes and his wife, Brittany, visited some of the injured children at a hospital, according to photos posted on social media.\n\nMahomes announced on X, formerly known as Twitter, that the Chiefs had established an emergency response fund for “victims and their families, violence prevention and mental health services, and first responders.”"
}