{
    "url": "https://www.washingtonpost.com/nation/2024/02/15/kansas-chiefs-parade-shooting-suspect-shooter/?itid=lk_inline_manual_38",
    "headline": "What we know about the shooting at the Kansas City Chiefs parade",
    "publishDate": "2024-02-15T07:42:22.670Z",
    "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FKWVDE4FWOQDUEVY2QFEKT7XIA.jpg&w=1440",
    "description": "One person was killed and at least 21 injured in Kansas City, Mo., during celebrations for the Chiefs’ Super Bowl win.",
    "content": "One person was killed and at least 22 were injured at a rally after a parade Wednesday celebrating the Kansas City Chiefs’ win at the Super Bowl. Shots were fired near Union Station in Kansas City, Mo., where Chiefs players had addressed the fan rally. Video showed people running from the site and police entering the building.\n\nThe shooting stemmed from a dispute among “several” people and spilled into the crowd, police said in a news conference Thursday. Two of those in custody are minors. Police said the shooting had no connection to terrorism.\n\nLisa Lopez-Galvan, a radio DJ and host of “A Taste of Tejano” on Kansas City radio station KKFI, was killed in the shooting, Tommy Andrade, a family friend and co-host of the show, told The Washington Post. Andrade said Lopez-Galvan’s husband, Mike, informed him of her death. In a statement, the station called her death a “senseless act.”\n\nAndrade described Lopez-Galvan, a mother of two, as a kind person with an infectious smile. “She treated everyone she knew and loved as close family. She will be missed,” he said.\n\nEight of those injured had immediately life-threatening injuries, and seven others had life-threatening injuries, Kansas City interim fire chief Ross Grundyson told reporters. Six others were considered to have minor injuries, he said.\n\nPolice have taken three people into custody and recovered firearms but have not yet disclosed a motive. Kansas City Police Chief Stacey Graves said the shooting happened despite a heavy police presence because of “bad actors.” Hundreds of law enforcement officers were policing the parade, she said, which allowed for a quick response.\n\nLaw enforcement has asked anyone who might have video of the shooting or of alleged shooters fleeing the scene to submit it to an FBI portal as authorities work to investigate the motive.\n\nThe shooting is the latest high-profile example of the entrenched problem of gun violence in the United States. President Biden said Wednesday that the shooting in Kansas City should “shock us” into acting to limit gun violence.\n\n“This is difficult for our community,” Lucas said in a statement posted to social media. “We will continue to work hard to ensure assailants are brought to justice, our victims receive exceptional care, all families impacted receive our support and that we as a city and country do all we can to prevent tragedies like this from ever occurring again.”\n\nTravis Kelce, the celebrated Chiefs tight end, also said he was “heartbroken” over the parade shooting. “My heart is with all who came out to celebrate with us and have been affected. KC, you mean the world to me,” he said in a post on social media."
}